{
    "0": "Gaju is the given name of which client profile?",
    "1": "The primary phone is 4256668888 for which customers who prefer to be called johnson?",
    "2": "Pick out the customer profile with a sentiment rating above 90 and a satisfaction rating over 80.",
    "3": "ceo is the position of which customer profile?",
    "4": "Shows the customers who have more than 3 children and who have ceo as their job title.",
    "5": "testemptyresult",
    "6": "Find customers with an annual income less than 10000.",
    "7": "Show all the customer whose preferred contact method is email.",
    "8": "contact given name doesn't contains mike",
    "9": "Make a list of customers with an engagement score higher than 10.",
    "10": "customers living in Seattle",
    "11": "which customerprofile's that has exchangerate  as 1.1?",
    "12": "Which customers identify as women?",
    "13": "contact whose full name contains mike",
    "14": "Customers that live in canada",
    "15": "lead has less than 1000 Employees",
    "16": "contact Donotallowbulkemail is true",
    "17": "which customer profile's Time is equal or more than 100",
    "18": "contact DoNotSendMarketingMaterials is true",
    "19": "open lead with budgetconstraint less than 20k and status is Will Buy",
    "20": "Which customer can be faxed at 123456?",
    "21": "Find the profile for the client with smith as their surname? ",
    "22": "Find all customers whose preferential name is johnson and main phone is 4256668888.",
    "23": "contact whose first name is mike",
    "24": "What customer is billed at 205 ne 32nd st?",
    "25": "Which customers have a churn score higher than 100?",
    "26": "Which customer's fax is 123456?",
    "27": "Provide a list of customers with a record created last month.",
    "28": "List all customers who are women",
    "29": "List the customer whose first name is exactly Gaju",
    "30": "Contacts electronicmail end with edu",
    "31": "Find customers whose nationality is china.",
    "32": "account name start with micro numberofemployees > 10000",
    "33": "account opendeals > 5 and openrevenue > 100m",
    "34": "contact that is created on 9-13-2020",
    "35": "contacts who live in canada",
    "36": "open lead with amountofbudget less than 20k and status is Will Buy",
    "37": "Locate all customers with a record created last month.",
    "38": "customers with customerprofileid is 78bfb768-71f4-45d5-a81b-6ed8d650cad8",
    "39": "Make a list of all customers from segment O365",
    "40": "The fraud score is under 30 for which customer?",
    "41": "Locate customers whose customer id type is abc.",
    "42": "male contacts in Germany and birth date is between 1970 and 2000 and income greater than $50K and job is manager",
    "43": "contact whose faxnumber is 1234567",
    "44": "Contact with email",
    "45": "contacts who have annual income higher than 100000",
    "46": "contact who has anniversary in next month",
    "47": "customer language french",
    "48": "Which customer graduated from mit and has an assistant named mike?",
    "49": "smith is the family name of which customer?",
    "50": "xyze456 is the account number for which customer?",
    "51": "pinabc is the pinterest identity for which customer?",
    "52": "account codeofindustry is Entertainment and MarketCapitalization > 1000M and reve > 100M",
    "53": "contacts with email address",
    "54": "Find the profile of the customer that abc created.",
    "55": "contacts enabled two factor authentication",
    "56": "Let me see the customer whose first name is Gaju.",
    "57": "contacts who are Employees",
    "58": "Which customer profile reflects bellevue as the msdynci_address 1 city and 500 NE 4TH ST as the shipping location?",
    "59": "contact whose honorifics is Dr",
    "60": "Which consumer profile has abc notes?",
    "61": "Accounts with missing primary contact",
    "62": "Look for the customer with a johnsmith Instagram account.",
    "63": "contact SendMarketingMaterial is true",
    "64": "contact whose role is Influencer",
    "65": "Find customers profile will consulting as Industry code",
    "66": "Which customer's mobile phone number is 4254086688?",
    "67": "contacts that prefer meeting on Mon",
    "68": "Which customer profiles have abc notes?",
    "69": "account statecode is active",
    "70": "customers whose profile type is Account, profile subtype is sth",
    "71": "What customer profile can be found on instagram at the handle johnsmith?",
    "72": "contact SendMarketingMaterials is true",
    "73": "Contcats in Paris France",
    "74": "opportunities estimate close in 30 days",
    "75": "contacts prefer to be contacted by phone",
    "76": "Find the customer with an anniversary next month.",
    "77": "customers whose o365loginname starting with abc and has no Business Phone",
    "78": "Prepare the list of customer whose department is sales?",
    "79": "A ceo position title reflects which particular client profile?",
    "80": "open lead with budgetamount less than 20k and status is Will Buy",
    "81": "Student first name is Gaju",
    "82": "contacts preferred contact method is email",
    "83": "contact whose given name is mike",
    "84": "O365 is the segment name for which customer?",
    "85": "account with web site url www.abc.com",
    "86": "lead whose nameofcompany is microsoft and confirminterest is true",
    "87": "contact whose manager is richard",
    "88": "lead whose companyname is microsoft and confirmInterest is true",
    "89": "Which customers first name is pronounced as peter?",
    "90": "Which customers have a yearly income lower than 10000?",
    "91": "Customer profile with fraud score below 30.",
    "92": "contact whose birthday is in next 3 month",
    "93": "I want to inquire about customers whose customeridtype is abc.",
    "94": "contact whose mobile phone is 4255556666",
    "95": "contact whose business phone is 425666633",
    "96": "contact whose nick name is nick, middle name is middle, and first name is last, and last name is first, and full name is full",
    "97": "account DonotallowBulkEmails is false, DonotallowEmails is true, SendMarketingMaterials is true",
    "98": "Which customer profile has the import sequence number 12345?",
    "99": "contact commemoration is in 2020 Oct",
    "100": "hot leads from Ads",
    "101": "Make me a list of all customers with the surname smith.",
    "102": "List all profiles of those customers whose Credits Completed is more than 100.",
    "103": "lead whose job title is manager whose name is john",
    "104": "whose customer profile's total lifetime spend amount  is equal to 400 or more?",
    "105": "contact whose salesstate is active",
    "106": "customers with Birthday in the next month ",
    "107": "abc is the customer identification for which client's profile? ",
    "108": "lead sale state is open and amount of budget < 20k and Budget is Will Buy",
    "109": "account with rev > $1M and state is NY",
    "110": "contact whose jubilee is 2020/9/13",
    "111": "Anniversary lies in next month for which customers.",
    "112": "contact whose greeting is Dr",
    "113": "contact whose description contains campaign",
    "114": "Retreive the customer profile which lists ceo as the job title.",
    "115": "contact whose middle name end with john",
    "116": "contacts confirmed phone number",
    "117": "contact whose birthday is in next month",
    "118": "Make a list of customers who are an alumni of mit.",
    "119": "contact forename doesn't contains mike",
    "120": "customer have more than 3 childrens",
    "121": "customers facebook profile is https://www.facebook.com/someone",
    "122": "Get me all customers whose billing address is 205 ne 32nd st.",
    "123": "Find customer with Gaju as their first name",
    "124": "contact whose Pagernumber is 12345",
    "125": "contact with last name ends with Smith",
    "126": "contact status is active",
    "127": "account which is private company and rev larger than 100m",
    "128": "Which client can be faxed at 123456?",
    "129": "Is there a customer with the first name Gaju?",
    "130": "contacts preferred meeting on Monday",
    "131": "contact whose last name is last and first name is first",
    "132": "What's the consumer profile with a ceo position title?",
    "133": "Find profiles of customers who are active and state their preferred contact method is fax.",
    "134": "Which client has 1.1 as its associated exchange rate?",
    "135": "The Anniversary for which customer takes place next month?",
    "136": "Find customers with middle name jack and is pronunciated as jaaaack",
    "137": "Search for all customers with a total lifetime spend amount of 400 or more.",
    "138": "contact anniversary is on 2020/9/13",
    "139": "Let me see the customer profiles that have more than 3 children.",
    "140": "Which client celebrates an anniversary next month?",
    "141": "Search for all customers that identify as women.",
    "142": "contact is female",
    "143": "Find the profile of the customer that graduated from mit.",
    "144": "Which customers were created by abc?",
    "145": "account which is private company and AnnualRevenue larger than 100m",
    "146": "contact whose full name does not start with mike",
    "147": "Customers whose email end with microsoft.com",
    "148": "Customers with annualincome less than 10000",
    "149": "Accounts with missing first contact",
    "150": "Contacts electronicmail contains abc",
    "151": "Prepare a list of customers that work in the consulting industry.",
    "152": "contact whose email address contains microsoft, employeeid start with 3, lastname is smith",
    "153": "Bring up the consumer profile with more than 100 msdynci_credits finished.",
    "154": "Customers working in sales department",
    "155": "living in ny city",
    "156": "account AccountName is microsoft",
    "157": "contact whose Last Date Included in Campaign is on 2020/9/13",
    "158": "Find all customers having influencerscore of higher than 70.7.",
    "159": "lead rating is hot",
    "160": "lead source is Advertisement",
    "161": "contact credit limit greater than 10000",
    "162": "students with creditscompleted of 12",
    "163": "Find the customer that is married.",
    "164": "which customer profile's has value the Sole Ownership in home ownership type?",
    "165": "Contacts owned by me",
    "166": "Contacts in Paris France",
    "167": "contacts that is created in last 90 days",
    "168": "contact whose pet name is nick and full name is full",
    "169": "lead in florida",
    "170": "contact with description equals new campaign in europe",
    "171": "Find the customer that has an engagement score that is higher than 10.",
    "172": "People that are single",
    "173": "johnsmith is the instagram handle for which customer?",
    "174": "account companyname is microsoft",
    "175": "open lead with amount of budget less than 20k and status is Will Buy",
    "176": "What customer was overidden last month?",
    "177": "What customer is of the nationality china?",
    "178": "Point out the client profile for which abc is the msdynci_complete name and microsoft is the business name.",
    "179": "contacts modified date is in Sep",
    "180": "Assemble a list of customers with 4252223333 as their home telephone number.",
    "181": "Find customer profile with the company name bwm",
    "182": "Show me the active customers whose preferred contact method is fax.",
    "183": "People that speak french",
    "184": "contact whose account role is Decision Maker",
    "185": "Find the customer with more than 3 children that has ceo as a job title.",
    "186": "contact whose birthday is in next 30 days",
    "187": "customers in companyname Microsoft OR segment is dynseg0102",
    "188": "Which customer profile goes by the salutation Dr?",
    "189": "Find customer profile with accountnumber xyze456",
    "190": "contact postal code is 98004",
    "191": "lead whose campaignname is abc",
    "192": "List all customers with more than 3 children",
    "193": "active customers preferred contact method is fax",
    "194": "contact without email",
    "195": "Which customer profile was made between 2018 and 2020?",
    "196": "next month is the beginning date of employment for which customer's profile? ",
    "197": "contact whose department is sales division",
    "198": "abc is the culture and usd is the currency for which customer?",
    "199": "Which customer profile was set up between 2018 and 2020?",
    "200": "Students that completed 100 credits",
    "201": "Which customer profile indicates Sole Ownership of their home? ",
    "202": "Which customer has a sentiment score over 90 and a satisfaction score over 80?",
    "203": "List the customer profile whose record was created last month.",
    "204": "contact whose last name is white",
    "205": "hot lead",
    "206": "lead donotbulkemail is true",
    "207": "contact who is employee, living in seattle, working in marketing department",
    "208": "customers with an annual income of $100,000",
    "209": "account StatusReason is inactive",
    "210": "Contact whose email address contains abc",
    "211": "clients in segment O365",
    "212": "contact whose email address contains microsoft, Employee start with 3, familyname is smith",
    "213": "Find all the customers that work in the consulting industry.",
    "214": "Customer profile with influencer score above 70.7.",
    "215": "Find customers profile with Dr as salutation.",
    "216": "contact whose statecode is active",
    "217": "contacts who are Decision Maker",
    "218": "Display a list of customers whose last name pronunciation is biden.",
    "219": "account with AnnualRevenue > $1M and state is NY",
    "220": "contacts with a main phone number",
    "221": "customers in companyname Microsoft AND segment is dynseg0102",
    "222": "contact whose employeeidentifier start with 365878",
    "223": "Show the profile whose first name is Gaju.",
    "224": "contact whose fax number is 1234567",
    "225": "contacts job title is IT manager",
    "226": "lead with estimated amount > 99,999 and estimated close date in next month",
    "227": "account which is private company and reve larger than 100m",
    "228": "Find the customer with an assistant named mike who graduated from mit.",
    "229": "Customers that do not have 100 credits",
    "230": "Show the customer profiles that have 123 as the customer id",
    "231": "contact production date is in last year",
    "232": "lead whose employername is microsoft and confirm interest is true",
    "233": "lead whose corporationname is microsoft and confirminterest is true",
    "234": "Show the customers that have more than 3 children",
    "235": "12345 is the import sequence number for which customer?",
    "236": "contacts email is tonylee@ford.com",
    "237": "Show me the profiles of the customers that allows postal mail.",
    "238": "Customers with ceo job title",
    "239": "What customer has an influencer score that's over 70.7?",
    "240": "contact doNotPhone is true",
    "241": "customers whose primary email is johnson@gmail.com",
    "242": "contact DonotallowEmails is true",
    "243": "Let me see the customers that have a birthday in the next month.",
    "244": "The churn score is higher than 100 for which customers?",
    "245": "Locate all customers with the middle name jack and whose middle name is pronounced jaaaack.",
    "246": "Find the customer with the position of ceo that has over 3 children.",
    "247": "account with revenue > $1M and state address is NY",
    "248": "Find customer with first name as peter",
    "249": "Which customers who women as their gender?",
    "250": "contacts who is active and gender is male and birthday on 7-31-1986",
    "251": "contact whose full name is mike white",
    "252": "123 is the customer identification for which listed client profile? ",
    "253": "Show all customers that are men.",
    "254": "List the customers who have 1.1 as their exchange rate.",
    "255": "People with an annual income of less than 20000",
    "256": "What customer profile is in the consulting industry?",
    "257": "lead with email address end with edu",
    "258": "account OpenDealscount > 5 and openrev > 100m",
    "259": "customers who has children is true and has pets is false",
    "260": "Contacts updated this month",
    "261": "customers whose twitter handler is mcdonald and web site url is https://www.whitehouse.gov",
    "262": "contact donotemail is true",
    "263": "customers living in USA born between 1970-2000",
    "264": "account name is microsoft",
    "265": "contact who created in last month, job title is it manager, prefer contact by email, perfer meeting on monday, donotphone is true",
    "266": "Find only those customers who allow postal mails.",
    "267": "Which customers has a birthday next month?",
    "268": "lead Status is open and amountofbudget < 20k and Budget is Will Buy",
    "269": "contacts language is english",
    "270": "morning is the preferred call time for which customer?",
    "271": "Find customers with Gaju as their first name.",
    "272": "Find the customer whose shipping address is 500 NE 4TH ST bellevue",
    "273": "Which customers have the CustomerId 123?",
    "274": "people that work at Amazon",
    "275": "Show the client profile with Sole Ownership as its kind of homeownership.",
    "276": "Which customer graduated from mit?",
    "277": "contact address is in seattle",
    "278": "contact birthday in Sep",
    "279": "Contacts whose email address is abc@gmail.com",
    "280": "contact whose honorifics is Mr",
    "281": "contacts who lives in new york",
    "282": "contact whose faxnumber number is 1234567",
    "283": "contacts that have email address test@test.com or test2@test.com",
    "284": "active account",
    "285": "contact whose main phone is 4256666333",
    "286": "account DonotallowBulkEmails is false, DonotallowEmails is true, DoNotSendMarketingMaterials is true",
    "287": "Dr is the salutation that should be used for which customer?",
    "288": "lead confirm interest is true",
    "289": "account with rev > $1M and state address is NY",
    "290": "contact whose division is sales division",
    "291": "contact DonotallowPhoneCalls is true",
    "292": "Find the customers with more than 1000 in lifetime value.",
    "293": "Which customers have an influencerscore more than 70.7?",
    "294": "contact created date is in last year",
    "295": "account email address is abc@gmail.com",
    "296": "Which client has over 3 children?",
    "297": "The given name peter is applicable to which client profile?",
    "298": "Make a list of customers who prefer to be called in the morning",
    "299": "customers whose donotcontact is true, donotfax is true, donotphone is true",
    "300": "List the customer profiles who have men as their gender.",
    "301": "contact who is modified on 2020/9/13",
    "302": "What client profile has abc as its notes?",
    "303": "contacts that have email address contains microsoft.com",
    "304": "Contacts whose preferred contact method is email",
    "305": "Married customers",
    "306": "List all the women customers",
    "307": "bwm is the company name for which contact?",
    "308": "Show the customer listed in the sales division.",
    "309": "Show me the profiles of customers whose time to live is at least 100.",
    "310": "Which client profile has preferred contact method is email coding?",
    "311": "contacts prefered method of contact is email",
    "312": "Which customer profile has a surname pronounced 'biden'",
    "313": "Which customer is a member of the sales department ?",
    "314": "Which customer's married?",
    "315": "What customers have 12345 as their import sequence number?",
    "316": "contacts preferred meeting in evening",
    "317": "Find customer who prefer that Len contact them.",
    "318": "male customers",
    "319": "What client can be reached at home at the no. 4252223333?",
    "320": "Find the customer with 4256668888 as a phone number and who prefers the name johnson.",
    "321": "contacts on hold time less than 10",
    "322": "contact who works in marketing department",
    "323": "account companyname start with micro Totalnumberofemployees > 10000",
    "324": "List the customer with first name of Gaju",
    "325": "A surname pronounced as biden pertains to which customer profile?",
    "326": "account with AnnualRevenue > $1M and state address is NY",
    "327": "contacts who have job title sales rep",
    "328": "Find all customers with the first name pronunciation of peter.",
    "329": " which customer profile's Credits Completed value is more than 100?",
    "330": "Which of the customers has abc in their notes?",
    "331": "Customer department is marketing",
    "332": "contact whose first name doesn't contains mike",
    "333": "Which customer profile's primary phone number is 4256668888 and has the preferred name johnson?",
    "334": "contact who has jubilee in next month",
    "335": "12345 is the import sequence number for which customers?",
    "336": "What client profiles are men?",
    "337": "What customer profile was contacted by Len?",
    "338": "Find the profile of the customer in the sales department.",
    "339": "account salestate is active",
    "340": "Which customer has the first name Gaju?",
    "341": "What customer profile interested in ski has the gamertag abc and counts pcgame among its hobbies?",
    "342": "contact whose salestate is active",
    "343": "Customers who are in Ohio",
    "344": "contact whose full name end with mike",
    "345": "Which customer profile has a ttlinseconds that's at least 100?",
    "346": "Which customers begin work next month?",
    "347": "mike is assistant to which listed customer who graduated from mit? ",
    "348": "Make a list of customers that have more than 3 children",
    "349": "account whose category is standard",
    "350": "customer postal code is 98052",
    "351": "Which client's notes is abc?",
    "352": "bwm is the name of the company for which customer?",
    "353": "Which customer has an exchange rate of 1.1?",
    "354": "Search for all customers whose company name is bwm.",
    "355": "contacts do not allow bulk email",
    "356": "contacts whose title is manager",
    "357": "Which customer has a pinterest ID of pinabc?",
    "358": "contact who is in Ohio",
    "359": "male contacts in Germany and birth date is between 1970 and 2000 and income greater than $50K and position is manager",
    "360": "A beginning employment date of next month indicates which consumer profile?",
    "361": "What customer has spent 400 or more in ltotal lifetime spend?",
    "362": "customers that created onbehalf by abc",
    "363": "abc is the culture and usd if the currency used by which customer?",
    "364": "customers whose donotbulkemail is true, donotbulkpostalmail is false, donotemail is false",
    "365": "contact whose employeeidentification start with 365878",
    "366": "Which customer can be reached at home @ 4252223333?",
    "367": "Which client profile has the mobile no. 4254086688?",
    "368": "Contacts emailaddress1 end with edu",
    "369": "customers with vice president as job title",
    "370": "contact whose forename is mike",
    "371": "primary contacts of accounts located in Seattle",
    "372": "Country is canada",
    "373": "contact account has value",
    "374": "contact modified date is after last month",
    "375": "contact whose department is sales",
    "376": "contact jubilee in Oct 2020",
    "377": "What customer pronounces their first name as 'peter'?",
    "378": "Which client profile has a bday next month?",
    "379": "Which customers have an employment start date of next month?",
    "380": "Show me the customer profile who has the first name Gaju.",
    "381": "Contacts emailaddress1 contains abc",
    "382": "Which customer profile can be reached via mobile @ 4254086688?",
    "383": "lead with quality code is hot and source is Advertisement",
    "384": "regular account",
    "385": "Find the customer with abc as their gamer tag who has pcgame as their hobby and is interested in ski.",
    "386": "created by tom",
    "387": "Which customers have a life time value that is more than 1000?",
    "388": "customers that identify as women",
    "389": "Which customer profile lists 4254086688 as the cell phone number?",
    "390": " preferred contact method is email for which customers?",
    "391": "Female customers",
    "392": "jaaaack is the pronunciation of the middle name of which customer that has the middle name of jack?",
    "393": "Which customers have biden as their last name pronunciation?",
    "394": "What customer prefers to be called johnson and can be reached primarily at 4256668888?",
    "395": "List customers whose salutation is Dr",
    "396": "O365 is the segment for which customer?",
    "397": "contact modified on 2020-9-13",
    "398": "contact donotpostalmail is true",
    "399": "A Sole Ownership homeownership category applies to which customer profile?",
    "400": "What customer has an engagement score that's above 10?",
    "401": "contact who live in Washington, birthday is in next month, gender is male",
    "402": "contacts who work at Microsoft",
    "403": "Contacts Email end with edu",
    "404": "contacts family name is white",
    "405": "male contacts in Germany and birth date is between 1970 and 2000 and income greater than $50K and role is manager",
    "406": "Customers born on valentine's day",
    "407": "account with reve > $1M and state address is NY",
    "408": "customers that speak French",
    "409": "contacts living in des moinnes",
    "410": "contacts with a business phone number",
    "411": "Which customer has spent 400 or more over their lifetime?",
    "412": "customers live in WA",
    "413": "contact who work for richard",
    "414": "Which client profile has the cell no. 4254086688?",
    "415": "contact commemoration in Oct 2020",
    "416": "account primaryindustry is Entertainment and capofmarket > 1000M and rev > 100M",
    "417": "contacts whose full name equals mike white or jeff white",
    "418": "customers with annual income greater than 10000",
    "419": "customers who Is Government is true, is lead is true, Is Public Sector is true",
    "420": "Find the customer whose given name is pronouced peter.",
    "421": "contact whose nick name is nick",
    "422": "contact whose email address contains microsoft, employeeidentifier start with 3, familyname is smith",
    "423": "Show all customers whose culture is abc and use usd as their currency",
    "424": "contact whose full name does not end with mike",
    "425": "Find the customer that prefers to be contacted by Len.",
    "426": "contact whose employeeid start with 365878",
    "427": "customer do not allow phone calls",
    "428": "Which customer with the gamertag abc has a ski interest and pcgame pastime?",
    "429": "account electronicmail is abc@gmail.com",
    "430": "account that is premium",
    "431": "lead whose job title is manager whose name is jhon",
    "432": "Customer profile with msdynci_creditscompleted exceeding 100.",
    "433": "contact who Do not allow emails",
    "434": "Which customer profiles use johnsmith on Instagram?",
    "435": "contacts in neworleans",
    "436": "lead statecode is open and budgetamount < 20k and budgetstatus is Will Buy",
    "437": "Find the profile of the customer with over 80 as a satisfaction score and over 90 as a sentiment score.",
    "438": "Show all customers whose time to live is at least 100.",
    "439": "Which customers have an exchange rate of 1.1?",
    "440": "Customers that live in Seattle or Vancouver",
    "441": "Which customer profiles belong to men?",
    "442": "living in littlestone",
    "443": "Which customer has  influencer score and that is greater than 70.7?",
    "444": "contact whose Employee start with 365878",
    "445": "contact created on 2020-9-13",
    "446": "Contacts electronicmailaddress contains abc",
    "447": "Who's the customer with a given name pronounced as peter?",
    "448": "customers whose second email is abc@gmail.com and primary email is abc@msn.com",
    "449": "Find the customers listed as men.",
    "450": "Which customer has 123 as their id?",
    "451": "which customers family status is married",
    "452": "Provide a list of customers who are alumni of mit.",
    "453": "123456 is the fax number listed for which customer?",
    "454": "lead in boston",
    "455": "contact whose greet is Dr",
    "456": "Contacts emailaddress contains abc",
    "457": "Provide the profile of customers answering false to don't mail by post.",
    "458": "contact prefers phone calls",
    "459": "sales is the department for which customer profile?",
    "460": "Customer profile with churn score over 100",
    "461": "customers that live in the city of vancouver",
    "462": "mobile phone is emtpy",
    "463": "Find customers who allow postal mail.",
    "464": "account postal code in WA 98074",
    "465": "contact whose characterization contains campaign",
    "466": "contacts job title is CEO",
    "467": "lead whose companyname is microsoft",
    "468": "City is Vancouver",
    "469": "Which customers had their record created last month?",
    "470": "Which customers have more than 3 kids and whose job title is ceo?",
    "471": "Find the profile of the customer with a churn score over 100.",
    "472": "customers not in msemails",
    "473": "account with reve > $1M and state is NY",
    "474": "contact who prefer meeting on monday but not morning",
    "475": "Find customers whose credits completed is more than 100.",
    "476": "account numberofOpenOpportunities > 5 and sumofopenrev > 100m",
    "477": "Find customers with a culture of abc and that uses usd currency.",
    "478": "active male contacts who born on July 31, 1986",
    "479": "contacts that is created in last 3 month",
    "480": "contact who created in last month, job title is it manager, prefer contact by email, perfer meeting on monday, DonotallowPhoneCalls is true",
    "481": "account nearby seattle",
    "482": "What client profile is named peter?",
    "483": "Retrieve all customers created by abc.",
    "484": "Which customers do allow postal mail?",
    "485": "Find the customer whose mobile phone number is 4254086688",
    "486": "Locate customers with the last name smith.",
    "487": "must have lead",
    "488": "customers who is known since last year",
    "489": "Contacts emailaddress1 start with abc",
    "490": "account Industry is Entertainment and MarketCapitalization > 1000M and AnnualRevenue > 100M",
    "491": "contacts who state is active and gender is male and birthday on 7-31-1986",
    "492": "customers that identify as women and are born on Christmas day",
    "493": "Name the customer with something less than 30 as the fraud score.",
    "494": "What customer's profile was created sometime between 2018 and 2020?",
    "495": "contacts whose birthday is in next month",
    "496": "contact whose Marital Status is married",
    "497": "Which customers are in segment O365?",
    "498": "Contacts Email contains abc",
    "499": "Show the customer whose full name is abc and who has microsoft as their company.",
    "500": "4252223333 is the home phone number for which customer?",
    "501": "china is the nationality of which customers?",
    "502": "account which is private company and salesrevenue larger than 100m",
    "503": "account reasonofstatus is inactive",
    "504": "Contacts emailaddress start with abc",
    "505": "contact whose salute is Dr",
    "506": "Which profiles have Dr as their salutation?",
    "507": "contact with illustration equals new campaign in europe",
    "508": "customers education code is master",
    "509": "account whose category is preferred customer",
    "510": "contact donotbulkemail is true",
    "511": "customers who is modified by jack in last month",
    "512": "contact do Not allow Phone",
    "513": "Which customer profile shows next month as the start date of employment?",
    "514": "customers living in USA",
    "515": "account in seattle",
    "516": "account with salesrevenue > $1M and state is NY",
    "517": "Show me the customers that have abc as their createdby.",
    "518": "Customers that are male",
    "519": "Instagram handle of johnsmith belongs to which customer profile?",
    "520": "Which customer is an alumni of mit?",
    "521": "Region is Seattle",
    "522": "contact whose employeeidentity start with 365878",
    "523": "Prepare a list of customers whose home ownership type is Sole Ownership.",
    "524": "contact whose greet is Mr",
    "525": "contact whose full name does not contains mike",
    "526": "account statuscode is inactive",
    "527": "Which customer has a first name that's Gaju?",
    "528": "Contacts not in Canada",
    "529": "account with revenue > $1M and state is NY",
    "530": "205 ne 32nd st is the billing address of which customer?",
    "531": "account salesstate is active",
    "532": "account businessindustry is Entertainment and marketvalue > 1000M and salesrevenue > 100M",
    "533": "Which customers have abc as their customer id type?",
    "534": "contact whose business phone is 4256666333",
    "535": "lead state is open and budgetconstraint < 20k and statusofbudget is Will Buy",
    "536": "What client profile has an abc gamer ID, a pcgame hobby, and also indicates a desire to ski?",
    "537": "A given name of Gaju pertains to which client profile?",
    "538": "contacts around Chicago",
    "539": "Find customer's profile with account number xyze456  ",
    "540": "contact sex is male",
    "541": "Find the customer with a full name of abc that shows microsoft as its company name.",
    "542": "contact birthday in Sep 21",
    "543": "contact whose facsimile number is 1234567",
    "544": "Show the customer profiles that have abc as the customer id type",
    "545": "account statuscoding is inactive",
    "546": "List all customers that are men",
    "547": "Find the profile of the customer who scored over 10 for engagement.",
    "548": "Retrieve the profile of the customer that was created between 2018 and 2020.",
    "549": "contact in WA",
    "550": "contact whose role in the company is Employee",
    "551": "lead industrycode is Entertainment and revenue < 100M",
    "552": "customers that modified by abc",
    "553": "Find customers who do allow postal mail.",
    "554": "account AccountName start with micro Noofemployees > 10000",
    "555": "A given name pronounced as peter is indicative of which customer profile?",
    "556": "contact anniversary is in 2020 Oct",
    "557": "Show me customers whose fax is 123456.",
    "558": "contact who living in postcode 98004",
    "559": "lead purchase process is committee",
    "560": "Customers with an anniversary in June",
    "561": "Which customer profiles reflect morning as the desired time to call?",
    "562": "customers with affiliations is abc and win oscar award",
    "563": "Which customers have the home phone number 4252223333?",
    "564": "account in Paris France",
    "565": "Find customers profile with china as nationality",
    "566": "contact gendercode is male",
    "567": "contacts whose child name is John",
    "568": "Find the profile for the customer with a churn score that is higher than 100.",
    "569": "contact whose manager is peter, and last used in campaign is last month, marketingonly is false",
    "570": " contacts tied to an organization with the name Costco",
    "571": "Display all customers who can be contacted  by Len?",
    "572": "Which clients are married?",
    "573": "lead industry is Entertainment",
    "574": "lead whose nameforcompany is microsoft and confirminterest is true",
    "575": "Customers with Total Transaction Count between 2 and 10",
    "576": "Which customers are from the consulting industry?",
    "577": "contact DonotallowBulkEmails is true",
    "578": "Customers that are married",
    "579": "Show me the customer profiles where their satisfaction score is larger than 80 and their sentiment score is larger than 90.",
    "580": "contacts who is created on today",
    "581": "Which client profile gives morning as the desired time to phone?",
    "582": "customer that are men",
    "583": "Show me all customers having their annualincome less than 10000,",
    "584": "contact whose email address contains microsoft, employeeidentity start with 3, familyname is smith",
    "585": "Locate all customers whose life time value is more than 1000.",
    "586": "What customer has an engagement score that's over 10?",
    "587": "contact DonotallowMails is true",
    "588": "contact who has child name is john",
    "589": "Which customer profiles have been created between 2018 and 2020.",
    "590": "Find the customer with more than 3 children.",
    "591": "customers family status is married",
    "592": "List all customers who work at microsoft and have the full name abc",
    "593": "123 is the customer identification for which client? ",
    "594": "contact with characterization equals new campaign in europe",
    "595": "contact donotsendmm is true",
    "596": "customers with Record Created in last month",
    "597": "Which client's named peter?",
    "598": "Show the customer with more than 100 msdynci_credits completed.",
    "599": "Show all the customers whose birthday is next month.",
    "600": "Look up the profile of the customer who can be billed at 205 ne 32nd st.",
    "601": "contact whose first name is mike or jeff",
    "602": "account with salesrevenue > $1M and state address is NY",
    "603": "Customers born November 1st",
    "604": "Show the customer whose shipping address is 500 NE 4TH ST in the city bellevue.",
    "605": "account Donotallowbulkemail is false, DonotallowEmails is true, SendMarketingMaterials is true",
    "606": "contacts whose job title is CEO",
    "607": "Dr is the greeting to be used for which customer?",
    "608": "Which client profile has a 123456 fax number?",
    "609": "contact whose pager is 12345",
    "610": "customers in segment high potential donars",
    "611": "What customer that transacts in usd belongs to the abc culture?",
    "612": "contact who living in France, income greater than $100k, credit limit >= 10000",
    "613": "active contact who is single, male, living in zipcode 98004",
    "614": "contact whose nick name is nick and full name is full",
    "615": "contacts who do not allow Bulk Emails",
    "616": "contact whose birthday is 2020/9/13",
    "617": "contact whose salute is Mr",
    "618": "Contacts emailaddress end with edu",
    "619": "contact in seattle",
    "620": "Show all the married customers",
    "621": "What customer has pinabc as their pinterest id?",
    "622": "contacts who work at Microsoft ",
    "623": "Which client has Sole Ownership of their home?",
    "624": "Find the profile with a 123 as the customer identification number. ",
    "625": "Customer first name is Gaju",
    "626": "contact jubilee is in 2020 Oct",
    "627": "Which customers have the first name peter?",
    "628": "mike is the assistant for which customer who is an alumni of mit?",
    "629": "abc is in the notes for which customer?",
    "630": "contacts birthday in Sep",
    "631": "customers whose linkedin profile is at https://www.linkedin.com/billg and facebook profile is at https://www.facebook.com/billgates",
    "632": "Accounts with primary contact null",
    "633": "customers who work at Microsoft",
    "634": "What customer has bwm as their company name?",
    "635": "morning is the best time to call which listed customer? ",
    "636": "Find the profile of the customer whose engagement is ranked above 10. ",
    "637": "Contact email address start with abc",
    "638": "Account has a name",
    "639": "Which customer has over 1000 in lifetime value?",
    "640": "Get the customer profile that is in the city of bellevue and has a shipping address of 500 NE 4TH ST.",
    "641": "People born on Christmas day",
    "642": "Which customers have a churn score bigger than 100?",
    "643": "Which customers have record creation dates of last month?",
    "644": "male contacts in Germany and birth date is between 1970 and 2000 and income greater than $50K and jobtitle is manager",
    "645": "contacts that is created before this month",
    "646": "List the customers with a fraud rating below 30. ",
    "647": "lead preferred contact method is email",
    "648": "Which customers have an influencer score higher than 70.7?",
    "649": "contacts who are in east time zone",
    "650": "Gaju is the given name of which customer?",
    "651": "Customers who have French as primary language",
    "652": "ceo is the position held by which customer?",
    "653": "pinabc is the pinterest id for which customer?",
    "654": "Contacts electronicmailaddress start with abc",
    "655": "contact whose Salutation is Dr",
    "656": "contact whose state is active",
    "657": "account AccountName start with micro Employeeheadcount > 10000",
    "658": "What customer profile lists a ttlinseconds that's at least 100?",
    "659": "List the customers with jack, which is pronounced jaaaack, as a middle name.",
    "660": "lead purchase timeframe is immediate",
    "661": "What client profile w/ ski as an interest and pcgame as a hobby has abc as the gamertag?",
    "662": "Which customer has china as their nation of origin?",
    "663": "customers annual income above 1m",
    "664": "lead telephone is 4251234567",
    "665": "contacts with number of children greater than 2",
    "666": "Which customers have a satisfaction score higher than 80 and a Sentiment Score above 90?",
    "667": "Find the customer profile showing a fraud score under 30.",
    "668": "Which customer is working as a ceo?",
    "669": "Which customer profile shows next month as their anniversary?",
    "670": "contact who is created on 2020/9/13",
    "671": "Show all customers that like to be called in the morning.",
    "672": "Customers country is france and language is set as english",
    "673": "Show me only those consumers whose pinterest id is pinabc.",
    "674": "customers whose mailing address is 555 NE 8th St Bellevue wa 98006",
    "675": "Contacts with vice president as job title",
    "676": "Make a list of customers whose preferred contact method is email",
    "677": "biden is the pronunciation of the family name for which customer?",
    "678": "contact whose full name start with mike",
    "679": "What client has a yearly income below 10000?",
    "680": "account donotbulkemail is false, donotemail is true, donotsendmm is true",
    "681": "Contacts electronicmailaddress end with edu",
    "682": "People that don't live in Seattle",
    "683": "Customer who have more than 3 childrens and job title is ceo",
    "684": "account industrycode is Entertainment and marketcap > 1000M and revenue > 100M",
    "685": "Determine the client profile with the middle name jack that's pronounced jaaaack.",
    "686": "male contacts in Germany and birth date is between 1970 and 2000 and income greater than $50K",
    "687": "contacts created this week",
    "688": "Which customers have their anniversary next month?",
    "689": "lead on hold time > 5",
    "690": "Which customers' last names are pronounced biden?",
    "691": "contact whose commemoration is 2020/9/13",
    "692": "people in seattle",
    "693": "lead in zipcode 98052",
    "694": "Get me all customers whose company name is microsoft and have the full name abc.",
    "695": "contact whose manager name is richard",
    "696": "Find all customers that work in the field of consulting.",
    "697": "contact whose greeting is Mr",
    "698": "account businessname start with micro Employeecount > 10000",
    "699": "Find the customer with a ceo position that has over 3 children.",
    "700": "Let me see the customer whose gamertag is abc, whose hobby is pcgame, and who is interest is ski.",
    "701": "Which client can be billed at 205 ne 32nd st?",
    "702": "contacts marketing only is true",
    "703": "Retreive the profile of the customer that has spent 400 or more over their lifetime.",
    "704": "account Status is active",
    "705": "contact whose anniversary is 2020/9/13",
    "706": "Customers with annualincome of 1000",
    "707": "contacts whose annual income > 100k",
    "708": "Show me a list of customers whose company name is bwm.",
    "709": "leads in UK",
    "710": "contact whose Salutation is Mr",
    "711": "Which customers have an employment start date next month?",
    "712": "male contacts in Germany and birth date is between 1970 and 2000 and income greater than $50K and title is manager",
    "713": "contact marketing only is true",
    "714": "Find customers who have a preferred contact method is fax and are active.",
    "715": "johnsmith is the Instagram handle for which customer?",
    "716": "Which customer profiles have an annual income less than 10000?",
    "717": "Which customer prefers that Len contact them?",
    "718": "account numberofOpenOpportunity > 5 and sumofOpenRevenue > 100m",
    "719": "Which customer is an alumni of mit and has mike as an assistant.",
    "720": "Find the active customer with preferred contact method is fax.",
    "721": "contact anniversary in Oct 2020",
    "722": "Find those customers whose company name is microsoft and have the full name abc.",
    "723": "contact Gender is male",
    "724": "account state is active",
    "725": "account businessname is microsoft",
    "726": "Customers in france and language is set as english",
    "727": "Customers in full time department",
    "728": "customers who work address is at 555 NE 8TH ST and work phone is 4356666888",
    "729": "birthday is in the next 3 months",
    "730": "contact whose illustration contains campaign",
    "731": "contact whose Status is active",
    "732": "ceo is the profession of which customer with more than 3 kids? ",
    "733": "lead salesstate is open and amountofbudget < 20k and Budget is Will Buy",
    "734": "Show me the customers who have a type abc ID.",
    "735": "Which customers have a fraudscore that is smaller than 30?",
    "736": "Show me the customers that have 400 or more as their total lifetime spend amount?",
    "737": "Which client has the account number xyze456?",
    "738": "A 1.1 rate of exchange is true for which customer profile?",
    "739": "contact whose dept is sales department",
    "740": "Customers whose preferred contact method is email",
    "741": "Contacts electronicmail start with abc",
    "742": "List the customer with xyze456 as their account number.",
    "743": "Select the consumer profile which shows a O365 segment name.",
    "744": "Which customers have more than 1000 in lifetime value?",
    "745": "account located in WA",
    "746": "Contacts owned by john",
    "747": "johnson is the preferred name and 4256668888 is the main phone number of which customer?",
    "748": "lead in zip code 98074",
    "749": "Find the customer that has mike as an assistant and that graduated from mit.",
    "750": "Which customers did abc create?",
    "751": "contact whose credit limit > 10k",
    "752": "Customers born in November",
    "753": "contact who works in sales department",
    "754": "companyname is amazon",
    "755": "Show the customer who has 12345 as their import sequence number.",
    "756": "contact whose email address contains microsoft, employeeidentification start with 3, familyname is smith",
    "757": "Retrieve all customers with a yearly income lower than 10000.",
    "758": "account numberofopendeal > 5 and openrev > 100m",
    "759": "customers not in high potential donars",
    "760": "customers with businessphone 12345678",
    "761": "Which customers have the culture abc and use usd as their currency?",
    "762": "contact state is active",
    "763": "Contacts Email start with abc",
    "764": "customers living in USA and born between 1970-2000",
    "765": "Which customer w/ the alias alias and nickname nick goes by the prefix mrs and suffix jr?",
    "766": "What client has a lifetime value that's over 1000?",
    "767": "Which customers were created by abc.",
    "768": "Which customer profiles have time to live as greater than or equal to 100 seconds?",
    "769": "contact",
    "770": "account which is VIP",
    "771": "account which is private company and revenue larger than 100m",
    "772": "Find customers with last name as smith.",
    "773": "contact that is modified on 9-13-2020",
    "774": "contacts created date is in Sep",
    "775": "Get the customer profile of the account that has the first name of peter.",
    "776": "contact who has commemoration in next month",
    "777": "Which customer's middle name is jack and is pronounced as jaaaack?",
    "778": "contacts allow to receive emails",
    "779": "Who is the customer whose preferred contact method is email?",
    "780": "china is the nationality of which customer?"
}